// Задайте строку, содержащую латинские буквы в обоих регистрах. 
// Сформируйте строку, в которой все заглавные буквы заменены на строчные.


string inputString = "Hello World";
string result = inputString.ToLower();

Console.WriteLine(result);

